import { Source } from "../entities/source.entity";

export const JAPANESE_SOURCES: Source[] = [
    {
        _id: 1,
        name: 'Try N1',
        link: '',
        _areaId: 1,
        sections: [{
            _id: 101,
            name: '1 オクトーバーフェスト'
        }, { 
            name: '2 産業医を増やそう'
        }, { 
            name: '3 飯食わぬ女房 (1)'
        }, { 
            name: '3 飯食わぬ女房 (2)'
        }, { 
            name: '4 上司との付き合い方 (1)'
        } , { 
            name: '4 上司との付き合い方 (2)'
        }, { 
            name: '5 転職 (1)'
        }, { 
            name: '5 転職 (2)'
        } , { 
            name: '5 転職 (3)'
        } , { 
            name: '6 研修を終えて'
        }, { 
            name: '7 さすが本田君 (1)'
        }, { 
            name: '7 さすが本田君 (2)'
        }, { 
            name: '8 楽園の萌香 (1)'
        }, { 
            name: '8 楽園の萌香 (2)'
        }, { 
            name: '9 トリアージ'
        }, { 
            name: '10 前衛書道'
        }]
    }, {
        _id: 2,
        name: 'JavaScript超入門コース',
        link: 'https://www.youtube.com/watch?v=_ExoqS3s17Y&list=PLavQwENTsEBVkrFMHDYs-EatjsxyoNNO-',
        _areaId: 2,
        sections: [
            {
                _id: 102,
                name: '01.コース紹介｜初心者にわかりやすいようなコースを作りました'
            }, {
                _id: 103,
                name: '02.JavaScriptとは？｜JavaScriptの特徴やできることなどをわかりやすく解説'
            }, {
                _id: 104,
                name: '04.プログラムの3つの基本構造｜プログラムの動きはシンプル。動きは3つだけ'
            }, { 
                name: '05.プログラム実行方法 ｜プログラムを書いて動かしてみよう'
            }, { 
                name: '06.変数 ｜変数は、例えるなら「箱」のこと。箱にデータを入れておくことができます'
            }, { 
                name: '07.データ型 ｜変数に入れるデータの種類のことです'
            }, { 
                name: '08.配列｜変数を箱。配列をロッカーに例えて解説します'
            }, { 
                name: '09.演算子｜足し算や引き算、2つの値の大小を比較するときに使います'
            }, { 
                name: '10.条件分岐｜条件にあてはまればAという処理、あてはまらなければBという処理ができます！'
            }, { 
                name: '11.繰り返し｜同じ処理を何度も実行できます'
            }, { 
                name: '12.関数 ｜関数を料理ロボットに例えて説明しました'
            }, { 
                name: '13.クラス｜クラスとは、「データ」と「処理」をまとめたもの'
            }, { 
                name: '14.実践｜すべて理解できればJavaScriptの超入門者から卒業です'
            }
        ]
    }, {
        _id: 3,
        name: 'コーヒーが冷めないうちに',
        link: '',
        size: 5,
        _areaId: 3,
        sections: [
            { 
                name: 'プロローグ'
            }, { 
                name: '第一話　「恋人」結婚を考えていた彼氏と別れた女の話'
            }, { 
                name: '第二話　「夫婦」記憶が消えていく男と看護師の話'
            }, { 
                name: '第三課　「姉妹」家出した姉とよく食べる妹の話'
            }, { 
                name: '第四話　「親子」この喫茶店で働く妊婦の話'
            }
        ]
    }, {
        _id: 4,
        name: '中級へ行こう',
        link: '',
        _areaId: 5,
        sections: [
            {
                _id: 105,
                name: '第一課　ファストフード'
            }, {
                _id: 106,
                name: '第二課　地震'
            },  { 
                name: '第三課　最近の子供'
            }, { 
                name: '第四課　インターネットの利用'
            }, { 
                name: '第五課　睡眠'
            }, { 
                name: '第六課　日本人の発明'
            }, { 
                name: '第七課　リサイクルとフリーマーケット'
            }, { 
                name: '第八課　あいづち'
            }, { 
                name: '第九課　男の仕事・女の仕事'
            }, { 
                name: '第十課　ことばの使い方'
            }
        ]
    }, {
        _id: 5,
        name: 'フレデリック 「ケンジとコウジのソウセイジカン」',
        link: 'https://www.youtube.com/watch?v=U_jykjGsFu0&list=PLdkuu8lINVU5oVGLU46ysqeqDlabD5OiD',
        _areaId: 4,
        sections: [
            { 
                name: 'フレデリック 「ケンジとコウジのソウセイジカン」予告'
            }, { 
                name: 'フレデリック 「ケンジとコウジのソウセイジカン」#1'
            }, { 
                name: 'フレデリック 「ケンジとコウジのソウセイジカン」#2'
            }, { 
                name: 'フレデリック 「ケンジとコウジのソウセイジカン」#3'
            }, { 
                name: 'フレデリック 「ケンジとコウジのソウセイジカン」#4'
            }, { 
                name: 'フレデリック 「ケンジとコウジのソウセイジカン」#5'
            }, { 
                name: 'フレデリック 「ケンジとコウジのソウセイジカン」#6'
            }, { 
                name: 'フレデリック 「ケンジとコウジのソウセイジカン」#7'
            }
        ]
    }
]

